Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In the case of Elasticsearch this support extends to the default Elasticsearch connection. What that means practically, is that if you have not configured `quarkus.hibernate-search-orm.elasticsearch.hosts`, Quarkus will automatically start an Elasticsearch container when running tests or in xref:dev-mode-differences.adoc[dev mode], and automatically configure the connection.
ja_jp: Elasticsearch の場合、このサポートはデフォルトの Elasticsearch 接続にも及んでいます。 つまり、 `quarkus.hibernate-search-orm.elasticsearch.hosts` を設定していない場合は、 Quarkus はテストの実行時または xref:dev-mode-differences.adoc[dev モード] で Elasticsearch コンテナーを自動的に起動し、 接続を自動的に設定します。

source: In the case of Elasticsearch this support extends to the default Elasticsearch connection. What that means practically, is that if you have not configured `quarkus.hibernate-search-standalone.elasticsearch.hosts`, Quarkus will automatically start an Elasticsearch container when running tests or in xref:dev-mode-differences.adoc[dev mode], and automatically configure the connection.
ja_jp: Elasticsearch の場合、このサポートはデフォルトの Elasticsearch 接続にも及んでいます。 つまり、 `quarkus.hibernate-search-standalone.elasticsearch.hosts` を設定していない場合は、 Quarkus はテストの実行時または xref:dev-mode-differences.adoc[dev モード] で Elasticsearch コンテナーを自動的に起動し、 接続を自動的に設定します。

source: In the case of Quarkus GitHub App, we don't really care about binary compatibility: when upgrading to a new version of the GitHub API, users will rebuild their application.
ja_jp: Quarkus GitHub Appの場合、バイナリ互換性はあまり気にしません。GitHub APIの新しいバージョンにアップグレードする場合、ユーザーはアプリケーションを再ビルドすることになります。

source: In the case of Quarkus REST, this annotation can only be used on endpoints annotated with link:{blockingannotation}[@Blocking] or considered blocking because of their signature. You can visit xref:rest.adoc#execution-model-blocking-non-blocking[Execution model, blocking, non-blocking] for more information.
ja_jp: Quarkus REST の場合、このアノテーションは、link:{blockingannotation}[@Blocking] のアノテーションが付与されたエンドポイント、 またはそのシグネチャーによりブロッキングと見なされるエンドポイントでのみ使用できます。 詳細は、xref:rest.adoc#execution-model-blocking-non-blocking[実行モデル、ブロッキング、ノンブロッキング] を参照してください。

source: In the case of `@Scheduled`, we link the cron expression back to the application property definition, much like we do for the `name` member of `@ConfigProperty`. Such cases allow us to easily relate the Java source files to their Quarkus configuration file.
ja_jp: `@Scheduled` の場合、 `@ConfigProperty` の `name` メンバと同様に、cron 式をアプリケーションのプロパティ定義にリンクします。このような場合、Java ソースファイルを Quarkus 設定ファイルに簡単に関連付けることができます。

source: In the case of `dead-letter-queue`, you can configure the following attributes:
ja_jp: `dead-letter-queue` の場合、以下の属性を設定することができます。

source: In the case of a `Publisher`, the template is rendered chunk by chunk following the requests from the subscriber. The rendering is not started until a subscriber requests it. The returned `Publisher` is an instance of `io.smallrye.mutiny.Multi`.
ja_jp: `Publisher` の場合、テンプレートはサブスクライバーからのリクエストに応じてチャンクごとにレンダリングされます。レンダリングは、サブスクライバーがリクエストするまで開始されません。返された `Publisher` は `io.smallrye.mutiny.Multi` のインスタンスです。

source: In the case of wrapper extensions like OpenShift and Minikube, when these extensions have been explicitly added to the project, the default `deployment-target` is set by those extensions. For example if `quarkus-minikube` has been added to a project, then `minikube` becomes the default deployment target and its resources will be applied to the Kubernetes cluster when deployment via `quarkus.kubernetes.deploy` has been set. Users can still override the deployment-targets manually using `quarkus.kubernetes.deployment-target`.
ja_jp: OpenShiftやMinikubeのようなラッパーエクステンションの場合、これらのエクステンションがプロジェクトに明示的に追加されているときは、それらのエクステンションによってデフォルトの `deployment-target` が設定されます。例えば、 `quarkus-minikube` がプロジェクトに追加されている場合、 `minikube` がデフォルトのデプロイメントターゲットになり、 `quarkus.kubernetes.deploy` 経由のデプロイメントが設定されていると、そのリソースが Kubernetes クラスターに適用されます。ユーザーは、 `quarkus.kubernetes.deployment-target` を使用して手動でディプロイメント ターゲットを上書きすることもできます。

source: In the case when one needs to register multiple synthetic beans at build time but only wants a subset of them active at runtime, it is useful to be able to mark a synthetic bean as _inactive_. This is done by configuring a "check active" procedure, which should be a `Supplier<ActiveResult>` obtained from a recorder:
ja_jp: ビルド時に複数の合成 Bean を登録する必要があるが、実行時にはそのうちのサブセットのみをアクティブにする場合、合成 Bean を _非アクティブ_ としてマークできると便利です。 これは、"check active" 手順を設定して行い、レコーダーから取得した `Supplier<ActiveResult>` になります。

source: In the case where the application developer does not need the combination of the client endpoint and the connector, a _basic connector_ can be used. The basic connector is a simple way to create a connection and consume/send messages without defining a client endpoint.
ja_jp: アプリケーション開発者がクライアントエンドポイントとコネクターの組み合わせを必要としない場合は、_基本コネクター_ を使用できます。 基本コネクターは、クライアントエンドポイントを定義せずに接続を作成し、メッセージを消費/送信する簡単な方法です。

source: In the case where we need to disable a particular task, we can use the following property:
ja_jp: 特定のタスクを無効にする必要がある場合、以下のプロパティを使用できます：

source: In the cluster mode, transaction commands (`MULTI`, `EXEC`, `DISCARD`, `WATCH`, `UNWATCH`) are handled specially.
ja_jp: クラスターモードでは、トランザクションコマンド ( `MULTI`, `EXEC`, `DISCARD`, `WATCH`, `UNWATCH` ) は特別に処理されます。

source: In the code above, we see that both field injection and constructor injection are being used (note that constructor injection does not need the `@Autowired` annotation since there is a single constructor). Furthermore, the `@Value` annotation on `suffix` has also a default value defined, which in this case will be used since we have not defined `greeting.suffix` in `application.properties`.
ja_jp: 上のコードでは、フィールドインジェクションとコンストラクタインジェクションの両方が使用されていることがわかります（コンストラクタインジェクションでは、コンストラクタが 1 つなので、 `@Autowired` のアノテーションは必要ないことに注意してください）。さらに、 `suffix` の `@Value` アノテーションには、デフォルト値も定義されています。この場合、 `application.properties` で `greeting.suffix` を定義していないので、これが使用されます。

source: In the configuration above, only the `registry.acme.org` is enabled. The configuration above is equivalent to:
ja_jp: 上記の設定では、 `registry.acme.org` のみが有効です。上記の設定は、以下と同等です:

source: In the console - just enable the DEBUG level in your `application.properties`, i.e. `quarkus.log.category."io.quarkus.arc.processor".level=DEBUG`
ja_jp: コンソールで - `application.properties` で DEBUG レベルを有効にするだけです。例: `quarkus.log.category."io.quarkus.arc.processor".level=DEBUG`

source: In the console you'll see startup messages from the lambda. This particular deployment starts a JVM and loads your lambda as pure Java.
ja_jp: コンソールには、ラムダからの起動メッセージが表示されます。この特定のデプロイメントでは、JVM を起動し、純粋な Java として Lambda をロードします。

source: In the console, you'll see startup messages from the lambda. This particular deployment starts a JVM and loads your lambda as pure Java.
ja_jp: コンソールには、ラムダからの起動メッセージが表示されます。この特定のデプロイメントでは、JVM を起動し、純粋な Java として Lambda をロードします。

source: In the context of GraalVM, DWARF stack traces contain more detail and are easier to understand than those generated with frame pointers. As first step, build a Quarkus native executable with debug info enabled and a couple of extra flags. One flag to disable optimizations, and another to avoid inlined methods being omitted from the stack traces. These two flags have been added to obtain stack traces that contain as much information as possible.
ja_jp: GraalVMのコンテキストでは、DWARFスタックトレースは、フレームポインタで生成されたものよりも詳細な情報を含み、理解しやすくなっています。最初のステップとして、デバッグ情報を有効にし、いくつかのフラグを追加したQuarkusネイティブ実行可能ファイルをビルドします。1つは最適化を無効にするフラグ、もう1つはインライン化されたメソッドがスタックトレースから省かれるのを避けるためのフラグです。この2つのフラグは、できるだけ多くの情報を含むスタックトレースを取得するために追加されています。

source: In the context of Quarkus and to build microservices, we thought the latter would make more sense. Thus we focused our efforts on it.
ja_jp: Quarkusとマイクロサービスを構築するという文脈では、後者の方がより意味があると考えました。そこで、私たちは後者に力を入れました。

source: In the context of Quarkus and to build microservices, we thought the latter would make more sense. Thus, we focused our efforts on it.
ja_jp: Quarkusとマイクロサービスを構築するという文脈では、後者の方がより理にかなっていると考えました。そこで、私たちは後者に力を入れました。

source: In the context of Quarkus and to build scalable applications, we thought the latter would make more sense. Thus, we focused our efforts on it.
ja_jp: Quarkus のコンテキストおよびスケーラブルなアプリケーションの構築において、Elasticsearch バックエンドの方適しています。 そこで、Elasticsearch バックエンドに重点を置いています。

source: In the context of a command line application, building an uber-jar is more practical if you plan on publishing the JAR as is.
ja_jp: コマンドラインアプリケーションのコンテキストでは、JAR をそのまま公開する予定の場合は、uber-jar をビルドする方が実用的です。

source: In the context of an extension, Quarkus eliminates the need for a JSON configuration file by allowing extension authors to specify a `NativeImageResourceBuildItem`:
ja_jp: エクステンションのコンテキストでは、Quarkus は、エクステンションの作成者が `NativeImageResourceBuildItem` を指定できるようにすることで、JSON 設定ファイルの必要性を排除しています。

source: In the default configuration, Keycloak is responsible for managing the roles and deciding who can access which routes.
ja_jp: デフォルトの構成では、Keycloakはロールを管理し、誰がどのルートにアクセスできるかを決定します。

source: In the default configuration, Keycloak manages the roles and decides who can access which routes.
ja_jp: デフォルト設定では、Keycloak はロールを管理し、誰がどのルートにアクセスできるかを決定します。

source: In the default lifecycle, Compose Dev Services will start and stop services automatically when the application starts and stops. For more fine-grained control, you can use the `start-services` and `stop-services` configuration properties.
ja_jp: デフォルトのライフサイクルでは、Compose Dev Services はアプリケーションの起動と停止時にサービスを自動的に起動および停止します。より詳細な制御には、`start-services` と `stop-services` の設定プロパティーを使用できます。

source: In the default mode, the `close()` method only delegates to `destroy()` when the bean is `@Dependent` (or when the instance handle does not represent a CDI contextual object). When the instance handle represents a bean of any other scope, the `close()` method does nothing; the bean is left as is and will be destroyed whenever its context is destroyed.
ja_jp: デフォルトモードでは、Bean が `@Dependent` の場合 (またはインスタンスハンドルが CDI コンテキストオブジェクトを表していない場合)、 `close()` メソッドは `destroy()` に委任するだけです。 インスタンスハンドルが他のスコープの Bean を表す場合、 `close()` メソッドは何も行いません。Bean はそのまま残され、コンテキストが破棄されると、Bean も破棄されます。

source: In the detailed steps below we will use the https://qpid.apache.org/components/jms/[Apache Qpid JMS] client via the https://github.com/amqphub/quarkus-qpid-jms/[Quarkus Qpid JMS extension]. Qpid JMS uses the AMQP 1.0 ISO standard as its wire protocol, allowing it to be used with a variety of AMQP 1.0 servers and services such as ActiveMQ Artemis, ActiveMQ 5, Qpid Broker-J, Qpid Dispatch router, Azure Service Bus, and more.
ja_jp: 以下の詳細な手順では、 link:https://github.com/amqphub/quarkus-qpid-jms/[Quarkus Qpid JMSエクステンション] を使用して link:https://qpid.apache.org/components/jms/[Apache Qpid JMS] クライアントを使用します。Qpid JMSは、ワイヤプロトコルとしてAMQP 1.0 ISO標準を使用しているため、ActiveMQ Artemis、ActiveMQ 5、Qpid Broker-J、Qpid Dispatchルーター、Azure Service Busなど、さまざまなAMQP 1.0サーバーやサービスで使用することができます。

source: In the dev mode, you can try out your gRPC services in the Quarkus Dev UI. Just go to http://localhost:8080/q/dev and click on _Services_ under the gRPC tile.
ja_jp: Devモードでは、Quarkus Dev UIでgRPCサービスを試すことができます。 http://localhost:8080/q/dev にアクセスし、gRPCタイルの下にある _Services_ をクリックするだけです。

source: In the dev mode, you can try out your gRPC services in the Quarkus Dev UI. Just go to http://localhost:8080/q/dev-ui and click on _Services_ under the gRPC tile.
ja_jp: 開発モードでは、Quarkus Dev UI で gRPC サービスを試すことができます。 その場合は、 http://localhost:8080/q/dev-ui にアクセスし、gRPC タイルの下にある _Services_ をクリックしてください。

source: In the dev mode, you can try out your gRPC services in the Quarkus Dev UI. Just go to http://localhost:8080/q/dev-v1 and click on _Services_ under the gRPC tile.
ja_jp: 開発モードでは、Quarkus Dev UIでgRPCサービスを試すことができます。 http://localhost:8080/q/dev-v1 に遷移し、gRPCタイルの下にある _Services_ をクリックします。

source: In the development mode, all files located in `src/main/resources/templates` are watched for changes and modifications are immediately visible.
ja_jp: 開発モードでは、 `src/main/resources/templates` にあるすべてのファイルの変更が監視され、変更はすぐに表示されます。

source: In the development mode, all files located in `src/main/resources/templates` are watched for changes. By default, a template modification results in an application restart that also triggers build-time validations.
ja_jp: 開発モードでは、`src/main/resources/templates` にあるすべてのファイルの変更が監視されます。 デフォルトでは、テンプレートを変更するとアプリケーションが再起動され、ビルド時の検証もトリガーされます。

source: In the development mode, i.e. when running `mvn quarkus:dev`, the application is executed and restarted every time the `Space bar` key is pressed. You can also pass arguments to your command line app via the `quarkus.args` system property, e.g. `mvn quarkus:dev -Dquarkus.args='--help'` and `mvn quarkus:dev -Dquarkus.args='-c -w --val 1'`.
ja_jp: 開発モード、つまり `mvn quarkus:dev` を実行しているときは、 `Space bar` キーが押されるたびにアプリケーションが実行され、再起動されます。また、 `quarkus.args` システムプロパティを介して、コマンドラインアプリに引数を渡すことができます。例えば、 `mvn quarkus:dev -Dquarkus.args='--help'` や `mvn quarkus:dev -Dquarkus.args='-c -w --val 1'` です。

source: In the development mode, i.e. when running `mvn quarkus:dev`, the application is executed and restarted every time the `Space bar` key is pressed. You can also pass arguments to your command line app via the `quarkus.args` system property, e.g. `mvn quarkus:dev -Dquarkus.args='--help'` and `mvn quarkus:dev -Dquarkus.args='-c -w --val 1'`. For Gradle projects, arguments can be passed using `--quarkus-args`.
ja_jp: 開発モード、つまり `mvn quarkus:dev` を実行している場合、アプリケーションは `Space bar` キーが押されるたびに実行され、再起動されます。また、コマンドラインアプリに引数を渡すには、 `quarkus.args` システムプロパティを使用します (例: `mvn quarkus:dev -Dquarkus.args='--help'` と `mvn quarkus:dev -Dquarkus.args='-c -w --val 1'` )。 Gradle プロジェクトの場合、引数は `--quarkus-args` を使用して渡すことができます。

source: In the development mode, it is also possible to enable monitoring of business method invocations and fired events. Simply set the `quarkus.arc.dev-mode.monitoring-enabled` configuration property to `true` and explore the relevant Dev UI pages.
ja_jp: 開発モードでは、ビジネスメソッドの呼び出しと発生したイベントの監視を有効にすることも可能です。 単に `quarkus.arc.dev-mode.monitoring-enabled` 設定プロパティを `true` に設定し、関連する Dev UI ページを探索するだけです。

source: In the development mode, two special endpoints are registered automatically to provide some basic debug info in the JSON format:
ja_jp: 開発モードでは、JSON 形式で基本的なデバッグ情報を提供するために、2 つの特別なエンドポイントが自動的に登録されます。

source: In the end, this results in a substantial amount of annotation processing for something that changes very rarely.
ja_jp: 結局のところ、めったに変更されないものに対して、かなりの量のアノテーション処理が行われていることになります。

source: In the example above the `artifact` used in the condition configuration happens to be a runtime Quarkus extension artifact but it could as well be any other artifact.
ja_jp: 上記の例では、条件設定で使用されている `アーティファクト` はランタイム Quarkus エクステンションアーティファクトですが、他のアーティファクトでも問題ありません。

source: In the example above the `artifact` used in the condition configuration happens to be a runtime Quarkus extension artifact but it could as well be any other artifact. There could also be more than one `artifact` element in the body of `dependencyCondition`.
ja_jp: 上記の例では、条件設定で使用されている `artifact` は、たまたまランタイムのQuarkusエクステンションアーティファクトでしたが、他のアーティファクトである可能性もあります。また、 `dependencyCondition` のボディ内に複数の `artifact` 要素が存在する可能性もあります。

source: In the example above, `GeneratedClassBuildItem` would only be produced if `ExecutorClassBuildItem` is consumed by some other build step.
ja_jp: 上記の例では、 `GeneratedClassBuildItem` は、 `ExecutorClassBuildItem` が他のビルドステップによって消費された場合にのみ生成されます。

source: In the example above, authentication of the `sayHello` endpoint is enforced with the `@Authenticated` annotation.
ja_jp: 上記の例では、`sayHello` エンドポイントの認証が `@Authenticated` アノテーションによって適用されます。

source: In the example above, only methods directly declared on the `MyRepository` interface are secured. Methods inherited from `CrudRepository`, such as `insert`, are not secured because type-level annotations only affect the type they annotate.
ja_jp: 上記の例では、 `MyRepository` インターフェースで直接宣言されたメソッドのみが保護されます。 `insert` などの `CrudRepository` から継承されたメソッドは、型レベルのアノテーションがアノテーションを付けた型自体にのみ影響するため、保護されません。

source: In the example above, the `lastName` field will be included in the JSON output only if the user has the `admin` role.
ja_jp: 上記の例では、ユーザーが `admin` ロールを持っている場合にのみ、 `lastName` フィールドが JSON 出力に含まれます。

source: In the example above, the `registry.acme.org` registry will be checked for catalog updates on every catalog request, while the `registry.quarkus.io` registry will be checked for catalog updates once a day (on the first catalog request of the day).
ja_jp: 上記の例では、 `registry.acme.org` レジストリは、カタログ要求ごとにカタログの更新がチェックされ、 `registry.quarkus.io` レジストリは、1日1回（その日の最初のカタログ要求時）にカタログの更新がチェックされます。

source: In the example above, we extended the `PanacheEntity` type, and did not define any database identifier, that's because `PanacheEntity` comes with a default generated database identifier, so you don't have to worry about it. It does this by extending the `WithId.AutoLong` class, which provides a generated database identifier of type `Long`.
ja_jp: 上記の例では、`PanacheEntity` 型を拡張し、データベース識別子を定義しませんでした。これは、`PanacheEntity` がデフォルトで生成されるデータベース識別子を備えているため、それについて心配する必要がないためです。これは、`Long` 型の生成されたデータベース識別子を提供する `WithId.AutoLong` クラスを拡張することで実現されます。

source: In the example above: - Port 7432 is mapped to the `quarkus.datasource.jdbc.port` property - Port 9080 is mapped to the `quarkus.http.port` property
ja_jp: 上記の例では: - ポート 7432 は `quarkus.datasource.jdbc.port` プロパティーにマッピングされます - ポート 9080 は `quarkus.http.port` プロパティーにマッピングされます

source: In the example below, this can be easily solved by adapting the annotation, adding @field: Default, to handle the lack of a @Target on the Kotlin reflection annotation definition.
ja_jp: 以下の例では、アノテーションに @field を追加することで、Kotlin のリフレクションアノテーション定義に @Target がない場合に対応し、問題を簡単に解決できます。

source: In the example scenario, Quarkus calls `/authenticated-welcome` after accepting a redirect from Auth0, completing the authorization code flow, and creating the session cookie. Successfully authenticated users are also allowed to access other parts of the secured application space, without needing to authenticate again. For example, the endpoint callback method can use a JAX-RS API to redirect users to other parts of the secured application where a session cookie will be verified.
ja_jp: この例では、Quarkus は Auth0 からのリダイレクトを受け入れ、認可コードフローを完了し、セッション Cookie を作成した後、 `/authenticated-welcome` を呼び出します。 認証に成功したユーザーは、再度認証することなく、保護されたアプリケーションスペースの他の部分にもアクセスできます。たとえば、エンドポイントコールバックメソッドは、JAX-RS API を使用して、セッション Cookie が検証される保護されたアプリケーションの他の部分にユーザーをリダイレクトできます。

source: In the explore section, you can query the data for all the data sources.
ja_jp: Explore セクションでは、すべてのデータソースのデータをクエリーできます。

source: In the final step, the LLM formulates a "Recommendation" or a definitive answer based on the analysis and synthesis performed in the preceding steps. This recommendation is the ultimate output of the CoT process.
ja_jp: 最終ステップでは、LLM は前のステップで実行された分析と統合に基づいて、「推奨」または決定的な回答を策定します。この推奨が CoT プロセスの最終出力となります。

source: In the following example we set up a consumer that always starts on messages from at most 10 minutes ago (or offset 0). First we need to provide a bean that implements `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` and is annotated with `io.smallrye.common.annotation.Identifier`. We then must configure our inbound connector to use this bean.
ja_jp: 以下の例では、最大 10 分前 (またはオフセット 0) からのメッセージで常に開始するコンシューマーを設定します。まず、 `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` を実装し、 `io.smallrye.common.annotation.Identifier` でアノテーションが付けられた Bean を提供する必要があります。次に、この Bean を使用するようにインバウンドコネクターを設定する必要があります。

source: In the following example we set-up a consumer that always starts on messages from at most 10 minutes ago (or offset 0). First we need to provide a bean that implements `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` and is annotated with `io.smallrye.common.annotation.Identifier`. We then must configure our inbound connector to use this bean.
ja_jp: 以下の例では、最大 10 分前（またはオフセット 0）のメッセージから常に開始するコンシューマ を設定します。 まず、 `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` を実装し、 `io.smallrye.common.annotation.Identifier` でアノテーションされた Bean を提供する必要があります。 次に、この Bean を使用するように受信コネクタを設定する必要があります。

source: In the following example, Quarkus includes the `ResourceForApp1Only` Resource class if and only if the build profile `app1` has been enabled.
ja_jp: 次の例では、Quarkusは、ビルドプロファイル `app1` が有効になっている場合に限り、 `ResourceForApp1Only` リソースを含めます。

source: In the following example, Quarkus includes the endpoint `sayHello` if and only if the build profile `app1` has been enabled.
ja_jp: 次の例では、 Quarkus は、ビルドプロファイル `app1` が有効になっている場合に限り、エンドポイント `sayHello` を含めます。

source: In the following example, Quarkus will exclude `RuntimeResource` at runtime if the application has `some.property` configured to `"disable"`.
ja_jp: 次の例では、アプリケーションで `some.property` が `"disable"` に設定されている場合、Quarkus は実行時に `RuntimeResource` を除外します。

source: In the following example, Quarkus will exclude the generated resource from the `PeopleResource` interface at runtime if the application has `some.property` configured to `"disable"`.
ja_jp: 以下の例では、アプリケーションが `some.property` を `"disable"` に設定している場合、Quarkus は生成されたリソースを実行時に `PeopleResource` インターフェースから除外します。

source: In the following example, Quarkus will include the generated resource from the `PeopleResource` interface if and only if the build profile `app1` has been enabled.
ja_jp: 以下の例では、ビルドプロファイル `app1` が有効になっている場合に限り、Quarkus は `PeopleResource` インターフェースから生成されたリソースを含めます。

source: In the following example, paths are ordered from the most specific to the least specific one:
ja_jp: 次の例では、パスは最も詳細なものから最も詳細でないものの順に並べられています。

source: In the following example, you have 3 different datasources:
ja_jp: 以下の例では、3 つの異なるデータソースがあります。

source: In the following tests we use the basic authentication mechanism, you can enable it by setting `quarkus.http.auth.basic=true` in the `application.properties` file.
ja_jp: 以下のテストでは、基本的な認証メカニズムを使用していますが、 `application.properties` ファイルに `quarkus.http.auth.basic=true` を設定することで有効にすることができます。

source: In the future we'll see a convergence of these two concepts, as people start adopting OpenTelemetry Logs.
ja_jp: 将来的には、OpenTelemetry ログの採用が進むことで、これら 2 つの概念が統合されることになるでしょう。

source: In the future, `@NativeImageTest` will be deprecated in favor of `@QuarkusIntegrationTest` which provides a superset of the testing capabilities of `@NativeImageTest`. More information about `@QuarkusIntegrationTest` can be found in the xref:getting-started-testing.adoc#quarkus-integration-test[Testing Guide].
ja_jp: 将来的には、 `@NativeImageTest` は廃止され、 `@NativeImageTest` のテスト機能のスーパーセットを提供する `@QuarkusIntegrationTest` が採用される予定です。 `@QuarkusIntegrationTest` についての詳細は、 xref:getting-started-testing.adoc#quarkus-integration-test[テスト・ガイド] に記載されています。

source: In the future, more events might be reported. For example:
ja_jp: 将来的には、さらに多くのイベントが報告されるようになるかもしれません。 例を挙げます。

source: In the generated build file, you can see 2 test dependencies:
ja_jp: 生成されたビルドファイルには、2つのテストの依存関係が示されています。

source: In the generated project, also add the following dependencies:
ja_jp: 生成されたプロジェクトに、以下の依存関係を追加します:

source: In the just released Quarkus 1.12.0.Final, your applications are now packaged as fast-jars by default.
ja_jp: リリースされたばかりのQuarkus 1.12.0.Finalでは、アプリケーションはデフォルトでfast-jarとしてパッケージ化されるようになりました。

source: In the labels tab, we see that Quarkus added the datasource label, which can be very useful in differentiating containers when multiple Dev Services have been started.
ja_jp: ラベルタブでは、Quarkusによってデータソースラベルが追加されていることがわかります。これは、複数のDev Servicesが起動されている時にコンテナを区別するのに非常に便利です。
